import re # цей модуль використовується для пошуку дійсних чисел у тексті за допомогою регулярного виразу
from typing import Callable # використовується для позначення типу функції як аргумент

def generator_numbers(text: str): # Функція приймає текстовий рядок  як аргумент
# функція  генерує всі дійсні числа, знайдені в тексті, як окремі значення

    pattern = r'\b\d+\.\d+\b'  # Регулярний вираз для знаходження дійсних чисел
    for match in re.finditer(pattern, text): #  знаходить усі збіги в тексті й повертає ітератор з об'єктами match
        yield float(match.group()) # отримує знайдений текст, перетворює у число, повертає число як генератор 

def sum_profit(text: str, func: Callable):
# для підсумовування чисел, отриманих з генератора і обчислення загального прибутку.
    return sum(func(text))

# Приклад використання:
text = "Загальний дохід працівника складається з декількох частин: 1000.01 як основний дохід, доповнений додатковими надходженнями 27.45 і 324.00 доларів."
total_income = sum_profit(text, generator_numbers)
print(f"Загальний дохід: {total_income}")
